{
  "id":1,
  "title": "The Life of Prophet Muhammad(PBUH)",
  "sections": [
    {
      "heading": "Early Life Of Muhammad",
      "content": "Orphaned at 6, Muhammad was saved from a life of slavery by his uncle who gave him a job in his successful caravan business. Married to a successful businesswoman in her own right, Muhammad saw firsthand how the leading families of the Quraysh lived. They were arrogant, reckless, ungenerous, and egotistical, believed only in riches, and took no responsibility for people outside their immediate, elite circle. Muhammad saw this decline in traditional values as a threat to the very existence of his tribe. He was sure that social reform had to be based on a new spiritual foundation, though before the revelations, he had no idea that his destiny would be to implement these changes."
    },
    {
      "heading": "Early Historians",
      "content": "Less than one hundred years after Muhammad’s death in 632 the first Muslim historians began to write about his life. These were Muhammad ibn Ishaq (d.767), Muhammad ibn ‘Umar al-Waqidi (d.ca 820); Muhammad ibn Sa’d (d.845); and Abu Jarir at-Tabari (d.923). These scholars reconstructed their narrative from oral traditions and early documents, and through their effort we know more about Muhammad than we do of any other Prophet."
    },
    {
      "heading": "Interpreting The Stories Of Muhammad's Life And Prophetic Narratives",
      "content": "Nevertheless, we need to keep in mind that the stories of Muhammad’s life were written to satisfy contemporary norms and included miraculous and legendary stories that might be misinterpreted today. As we have noted with the stories surrounding the Axial Sages, the Old Testament, and the Gospels, such accounts are not to be taken literally. According to Reza Aslan in 'No god but God', The Origins, Evolution, and Future of Islam they “function as prophetic topos: a conventional literacy theme that can be found in most mythologies. Like the infancy narratives in the Gospels, these stories are not intended to relate historical events, but to elucidate the mystery of the prophetic experience. They answer the questions: What does it mean to be a prophet?… It is not important whether the stories describing the childhood of Muhammad, Jesus, or David are true. What is important is what these stories say about our prophets, our messiahs, our kings: that theirs is a holy and eternal vocation, established by God from the moment of creation."
    },
    {
      "heading": "The Story Of Muhammad's Birth And The Year Of The Elephant",
      "content": "According to tradition, Muhammad was born in Mecca in 570, the year known as the Year of the Elephant, in which Mecca was miraculously saved. Tradition tells that Abraha, the Abyssinian Christian ruler of Yemen, attacked Mecca with a herd of elephants imported from Africa. Abraha’s goal was to destroy the Ka’ba and make the Christian church at Sana’ the new religious center of the Arab world. The terrified Quraysh had never seen an elephant, much less a whole herd, so they ran to the mountains to escape, leaving the Ka’ba with no defense. But just as it was about to be attacked, the sky went dark as a flock of birds, each carrying a stone in its beak, rained down on the invading army which was forced to retreat. Many stories surround his childhood and birth, which was announced in a tale similar to the Christian story of Mary: Muhammad’s mother, a widow named Amina, one day heard a voice say to her: “You carry in your womb the lord of this people, and when he is born, say: ‘I place him beneath the protection of the One, from the evil of every envious person’, then name him Muhammad."
    },
    {
      "heading": "Reinterpreting Muhammad's Name And Early Years In Semitic Context",
      "content": "In 'Muhammad, the World-Changer', Mohamad Jebara, historian and scholar of Semitic languages, provides a different account of Muhammad’s life and early years culled from extensive research into original sources. Keep in mind that, in common with other Semitic languages, Arabic words are mostly constructed from 3 or sometimes 4 letter roots, each root providing the core meaning. Jebara’s findings indicate that the name Muhammad was given to him by his grandfather, Abd-Al-Muttalib. Abd-Al-Muttalib, the son of a Jewish mother and a father he didn’t remember, chose a name with “an archaic Semitic root, H-M-D, not commonly used in Mecca,” that meant ‘the exemplary one’ “so that his example would be exulted in the highest places and his name would come to be known among the nations.” The root H-M-D, Jebara notes, “describes someone standing on an elevated platform who demonstrates actions to be emulated by onlookers.” The prefix M that starts the name “transformed the root action described from something finite to something timeless…Muhammad describes a constant state of doing, perpetually inspiring…others to emulate his example."
    },
    {
      "heading": "Muhammad's Early Life: Orphanhood, Upbringing, And The Encounter With Bahira",
      "content": "Muhammad was orphaned at the age of six when his mother died. M.Jebara writes movingly that her last words to her son were “Kun rajula,” meaning, “Be a world-changer.” Muhammad went to live with his grandfather Abd-Al-Muttalib, who was in charge of providing the water from the Zam-Zam well to pilgrims. Abd-Al-Muttalib, who had suffered the loss of his favorite son, Muhammad’s father, took the young child under his wing. He taught his grandson the Arabic language in great detail, including how to present arguments effectively. During his time with his grandfather, Muhammad learned about slavery, a practice he abhorred. He took steps to immediately release his slave Barakah—who had been with him since his birth. She was overjoyed but chose to remain by his side and was one of his closest followers throughout his life. But by the time he was eight years old, his grandfather, too, had died. Fortunately, his Uncle Abu Talib saved the young Muhammad from a life of slavery or indebtedness experienced by so many orphans at the time. He employed him in his successful caravan business. In a story that resembles that of Samuel in the Old Testament and others of that genre, it was on a trading expedition to Syria, when Muhammad was only nine years old, that a Christian monk named Bahira recognized him as “the Messenger of the Lord of the Worlds."
    },
    {
      "heading": "Muhammad's Youth: Friendship, Social Justice, And The Pact Of Hilf-Ul-Fudhul",
      "content": "As a young man, Muhammad befriended a like-minded youth, three years his junior, named Atiq, whom he later named Abu Bakr. Muhammad had an acute sense of social justice, and even as a youth, he stood up to some powerful men in Meccan society, earning their enmity. Muhammad, with a group of friends and an older mentor, established a pact known as Hilf-ul-Fudhul (the Pact to Enhance Society’s Honor) “to protect vulnerable vendors from abusive Meccan elders and to ensure honest financial dealings.” They pledged to act “to uphold the right of anyone who is wronged."
    },
    {
      "heading": "Muhammad's Marriage To Khadija: The Turning Point In His Life",
      "content": "At twenty-five, when Muhammad was still unmarried and dependent on his uncle, he met a very distant cousin, Khadija, a beautiful widow, then probably 28, as calculated by Jebara. Khadija was unusual for a woman of her time; she was a respected member of Meccan society and a very successful businesswoman in her own right. In spite of his tenuous social circumstances, according to Ibn Hisham, Muhammad had a reputation for “truthfulness, reliability, and nobility of character,” and Khadija entrusted him to take a caravan of goods to Syria and sell it. When he returned home with more profits than she anticipated, she sent two confidants to check him out. Both confidants gave her extremely favorable reports on his character and acumen. She then proposed marriage to him and he accepted, thus acquiring status and entry into Meccan society."
    },
    {
      "heading": "Muhammad And Khadija: Family And Relationships",
      "content": "Khadija gifted him a slave of hers, Zaid, whom Muhammad promptly freed. Zaid, free to leave, chose to live with Muhammad, who adopted him as his son. Although polygamy was the norm at the time, Muhammad and Khadija were in a monogamous marriage for twenty-five years until her death. They had six children."
    },
    {
      "heading": "Muhammad's Observations Of Meccan Society And The Beginning Of His Spiritual Journey",
      "content": "As an orphan himself, Muhammad would have been aware of just how easy it was to fall outside Mecca’s religio-economic system. With his marriage and his businesses doing well, he now had access to the prosperous life. He saw firsthand that although the leading families of the Quraysh believed in the one God, this belief was not relevant to their lives; they had forgotten that everything depended upon Him. Now that they were rich, they adhered to the very worst aspects of murawah and had thrown away the best: they were arrogant, reckless, ungenerous and egotistical; they had become self-centered, no longer believing in anything but riches and took no responsibility for people outside their immediate, elite circle. The cave Hira in the mountain Jabal al-Nour where, according to Muslim belief, Muhammad received his first revelation."
    },
    {
      "heading": "Muhammad's Concern For Social Reform And The Influence Of Other Religions",
      "content": "Muhammad saw the decline in traditional values as a threat to the very existence of his tribe. He was sure that social reform had to be based on a new spiritual foundation for it to actually take effect. As a trader, Muhammad came in frequent contact with Jews and Christians. According to the scholar Ikbal Ali Shah, Muhammad made “an exhaustive study of other religions.” He was aware that his own people, although they believed in al-Lah, lacked a sacred book of their own. “The people of the Book” had codified Laws that were both religious and social, governing their behavior from dawn to dusk. His own people had no such thing and because of this their lives were in chaos, many were suffering and destitute, and the whole tribe was in danger of extinction."
    },
    {
      "heading": "Muhammad's Initial Reluctance And Khadija's Support In The Face Of Revelation",
      "content": "Before the revelations, he had no idea that his destiny would be to implement these vital changes. He was from a minor clan, the Hashim, and scholars point out that, in common with other prophets before him, he initially wanted nothing to do with what was happening to him and was extremely upset, so much so that without Khadija’s intervention “Mohammad might have gone through with his plan to end it all, and history would have turned out quite differently."
    }
  ]
}
