{
  "id": 2,
  "name": "The Life of Abu Huraira",
  "person": "Abu Hurayrah (R.A.): The Prolific Narrator Of Hadith And Companion Of Prophet Mohammad (S.A.W.)",
  "biography": [
    {
      "section": "Introduction",
      "content": "Abu Hurayrah Al-Dawsi Al-Zahrani, often spelled Abu Hurairah (R.A.), was one of the companions (Sahabah) of Prophet Mohammad (S.A.W.) and the most prolific narrator of Hadith. He narrated more than 5000 hadiths (about 5374 hadiths). Abu Hurayrah (R.A.) was a simple man from Yemen but through his enormous efforts rose to one of the highest positions in Islamic history. He was known by the kunyah Abu Hurayrah \"Father of a Kitten\". Abu Hurayrah (R.A.) spent four years (some say two years) in the company of the Prophet Mohammad (S.A.W.) and went on expeditions and journeys with him."
    },
    {
      "section": "Early Life",
      "content": "Abu Hurayrah’s (R.A.) father died when he was young. According to some sources, his name at birth was Abdu-Shams. Abu Hurayrah became a Muslim at the hands of At-Tufayl ibn Amr (R.A.), the chieftain of the Banu Daws tribe to which he belonged. The Banu Daws lived in the region of Tihamah which stretches along the coast of the Red Sea in southern Arabia. When At-Tufayl (R.A.) returned to his village after meeting the Prophet Mohammad (S.A.W.) and becoming a Muslim in the early years of his mission, Abu Hurayrah (R.A.) was one of the first to respond to his call. He was unlike the majority of the Banu Daws who remained stubborn in their old beliefs for a long time."
    },
    {
      "section": "The Conversion Of His Mother To Islam",
      "content": "When At-Tufayl (R.A.) visited Makkah again, Abu Hurayrah (R.A.) accompanied him. There he had the honor and privilege of meeting the noble Prophet (S.A.W.) who asked him: \"What is your name?\"\"Abdu Shams - Servant of a Sun,\" Abu Hurayrah (R.A.) replied.\"Instead, let it be Abdur-Rahman - the Servant of the Beneficent Allah ,\" said the Prophet (S.A.W.).\"Yes, Abdur-Rahman (it shall be) O Messenger of Allah (S.A.W.),\" he replied. However, he continued to be known as Abu Hurayrah \"the father of a kitten\" because like the Prophet (S.A.W.), he was fond of cats and since his childhood often had a cat to play with."
    },
    {
      "section": "Life in Madinah",
      "content": "Abu Hurayrah (R.A.) stayed in Tihamah for several years and it was only at the beginning of the seventh year of the Hijrah that he arrived in Madinah with others of his tribe. The Prophet (S.A.W.) had gone on a campaign to Khaybar. Being destitute, Abu Hurayrah (R.A.) took up his place in the Masjid with other of the Ahl as-Suffah. He was single, without wife or child. With him however was his mother who was still a mushrik (non-believer). He longed, and prayed, for her to become a Muslim but she adamantly refused. One day, he invited her to have faith in Allah alone and follow His Prophet (S.A.W.) but she uttered some words about the Prophet (S.A.W.) which saddened him greatly. With tears in his eyes, he went to the Holy Prophet (S.A.W.) who said to him: \"What makes you cry, O Abu Hurayrah?\"\"I have not let up in inviting my mother to Islam but she has always rebuffed me. Today, I invited her again and I heard words from her which I do not like. Do make supplication to Allah Almighty to make the heart of Abu Hurayrah's mother incline to Islam.\" The Prophet (S.A.W.) responded to Abu Hurayrah's (R.A.) request and prayed for his mother. Abu Hurayrah said: \"I went home and found the door closed. I heard the splashing of water and when I tried to enter my mother’s room, mother said: \"Stay where you are, O Abu Hurayrah.\" And after putting on her clothes, she said, \"Enter!\" I entered and she said: \"I testify that there is no god but Allah and I testify that Muhammad is His Servant and His Messenger.\"\"I returned to the Prophet (S.A.W.) weeping with joy just as an hour before I had gone weeping from sadness and said: \"I have good news, O Messenger of Allah. God has responded to your prayer and guided the mother of Abu Hurayrah to Islam.\""
    },
    {
      "section": "The Beloved Companion And Prolific Hadith Narrator",
      "content": "Abu Hurayrah loved the Prophet (S.A.W.) a great deal and found favor with him. He was never tired of looking at the Prophet (S.A.W.) whose face appeared to him as having all the radiance of the sun and he was never tired of listening to him. Often he would praise Allah for his good fortune and say: \"Praise be to Allah Who has guided Abu Hurayrah to Islam.\" Praise be to Allah Who has taught Abu Hurayrah the Quran.\"\"Praise be to Allah who has bestowed on Abu Hurayrah the companionship of Mohammad (S.A.W).\" On reaching Madinah after migration, Abu Hurayrah (S.A.) set his heart on attaining knowledge. Zayd ibn Thabit (R.A.) has reported: \"While Abu Hurayrah and I and another friend of mine were in the Masjid praying to Allah and performing dhikr to Him, the Messenger of Allah appeared. He came towards us and sat among us. We became silent and he said: \"Carry on with what you were doing.\"\"So my friend and I made a supplication to Allah before Abu Hurayrah (R.A) did and the Prophet (S.A.W.) began to say Ameen to our dua.\"Then Abu Hurayrah (R.A.) made a supplication saying: \"O Lord, I ask You for what my two companions have asked and I ask You for knowledge which will not be forgotten.\"\"The Prophet (S.A.) said: 'Ameen.' \"We then said: 'And we ask Allah for knowledge which will not be forgotten, and the Prophet replied: 'The Dawsi youth has asked for this before you.\" \"With his formidable memory, Abu Hurayrah (R.A.) set out to memorize in the four years that he spent with the Prophet (S.A.W.), the gems of wisdom that emanated from his lips. He realized that he had a great gift and he set about to use it to the full in the service of Islam. He had free time at his disposal. Unlike many of the Muhajirin (immigrants of Makkah), he did not busy himself in the market-places, with buying and selling. Unlike many of the Ansaar (Muslim residents of Madinah), he had no land to cultivate nor crops to tend. He stayed with the Prophet (S.A.W.) in Madinah and went with him on journeys and expeditions."
    },
    {
      "section": "Memory and Hadith Narration",
      "content": "Many companions were amazed at the number of hadiths he had memorized and often questioned him on when he had heard a certain hadith and under what circumstances. Once Marwan ibn al-Hakam (R.A.) wanted to test Abu Hurayrah's (R.A.) power of memory. He sat with him in one room and behind a curtain he placed a scribe, unknown to Abu Hurayrah (R.A.), and ordered him to write down whatever Abu Hurayrah (R.A.) said. A year later, Marwan called Abu Hurayrah (R.A.) again and asked him to recall the same hadiths which the scribe had recorded. It was found that he had forgotten not a single word."
    },
    {
      "section": "The Dedicated Teacher, Humble Servant, And Model Of Gratitude",
      "content": "Abu Hurayrah (R.A.) was concerned to teach and transmit the hadiths he had memorized and knowledge of Islam in general. It is reported that one day he passed through the suq (market) of Madinah and naturally saw people engrossed in the business of buying and selling. \"How feeble are you, O people of Madinah!\" he said.\"What do you see that is feeble in us, Abu Hurayrah?\" they asked.\"The inheritance of the Messenger of Allah (S.A.W.) is being distributed and you remain here! Won't you go and take your portion?\"\"Where is this, O Abu Hurayrah?\" they asked. \"In the Masjid,\" he replied. Quickly they left. Abu Hurayrah (R.A.) waited until they returned. When they saw him, they said: \"O Abu Hurayrah, we went to the Masjid and entered and we did not see anything being distributed.\"\"Didn't you see anyone in the Masjid?\" he asked.\"O yes, we saw some people performing Salat, some people reading the Quran and some people discussing about what is halal and what is haram.\"\"Woe unto you,\" replied Abu Hurayrah (R.A.) \"That is the inheritance of Muhammad (S.A.W.).\"Abu Hurayrah (R.A.) remained his entire life in poverty. He would even go without food for days. Yet, whenever he could, he would utter words to express the gratitude and contentment he felt. He said: \"I grew up as an orphan and I emigrated as a poor man. I used to be a hireling of Busra bint Ghazwan for my meals. I served the Prophet (S.A.W.) and fed myself on dates. And now, I am the Ameer (Governor) of Bahrain and married to Busra (R.A.) herself. Praise be to Allah who has strengthened His religion and made me an Imaam (leader).\""
    },
    {
      "section": "Death and Legacy",
      "content": "Ten years after the death of the Prophet (S.A.W.), Abu Hurayrah (R.A.) was appointed governor of Bahrain. During the caliphate of Umar ibn Al-Khattab (R.A.) in 23 A.H., he was appointed the governor of Bahrain, as well as later in the caliphate of Mu'awiyah (R.A.). At the age of 78 (or 80), Abu Hurayrah (R.A.) passed away. He left a legacy of unending scholarship. His life story is an inspiration to all Muslims across the world to seek knowledge and to work tirelessly in the cause of Islam. May Allah be pleased with him and grant him Jannatul Firdaus."
    }
  ]
}
